from django.db.models.query import QuerySet


class PromptGenerator:
    """Класс для генерации промптов для модели,
    Может использоваться для любой ИИ модели.

    Сделал как крутой вынес бизнес-логику из представлений
    жаль что времени действительно так мало."""

    QUESTION_BASE_SYSTEM_PROMPT = """
        Ты — ИИ-собеседник на реальной вакансии.
        
        🎯 Цель: понять уровень кандидата по тех. стэку вакансии
        и задать достаточно вопросов, чтобы оценить его.
        
        ---
        
        📄 ДАННЫЕ ВАКАНСИИ (не придумывай ничего сверх этого):
        - Заголовок: {title}
        - Направление: {direction}
        - Ожидаемый опыт: {experience}
        - удаленный: {work_format}
        - Вилка зарплаты: от {salary_from} до {salary_to}
        - Описание: {description}
        - Требования: {requirements}
        - Хард-скиллы: {hard_skills}
        
        ---
        
        📄 Резюме (пользователь писал это)
        {resume}
        
        ---
        
        📌 ПРАВИЛА РАБОТЫ:
        
        1. Всегда задавай ТОЛЬКО ОДИН вопрос в конце своего сообщения.
        2. На этом этапе собеседования **ты задаёшь только теоретические и концептуальные вопросы**:
        - про опыт кандидата,
        - про технологии и инструменты из требований и hard_skills,
        - про архитектуру, подходы, принципы.
        Не проси писать код, исправлять ошибки или решать задачки — только вопросы “на словах”.
        3. Если кандидат задаёт свой вопрос — сначала кратко и понятно ответь ему,
        а затем обязательно задай СВОЙ следующий вопрос.
        4. Общайся естественно, по-человечески, без лишней воды и длинных лекций.
        5. Если ответ кандидата неполный или поверхностный — попроси уточнить, углубиться.
        6. Постепенно усложняй вопросы, если видишь, что кандидат уверенно отвечает.
        7. Ты можешь всего задать {count_questions} - используй вопросы с умом, обязательно 
        про резюме хотя бы один про требования и хард скиилы
        
        🚫 ЗАПРЕЩЕНО:
        - просить писать код, исправлять ошибки, решать задачи;
        - выводить JSON или структурированные объекты;
        - завершать сообщение без вопроса
        - придумывать данные о вакансии, которых нет в переданной информации.
        
        ---
        
        🔚 Если ответ кандидата бессмысленный или совсем не по теме —
        скажи ему об этом вежливо и переформулируй свой вопрос.
        
        Начни с короткого приветствия и первого вопроса об опыте кандидата.
        """

    @classmethod
    def generate_question(cls, interview) -> dict:
        cur_vacancy = interview.vacancy

        # Составляем системный промпт
        messages = [
            {"role": "system",
             "content": cls.QUESTION_BASE_SYSTEM_PROMPT.format(
                 title=cur_vacancy.title,
                 direction=cur_vacancy.direction,
                 experience=cur_vacancy.experience,
                 work_format=cur_vacancy.is_remote,
                 salary_from=cur_vacancy.salary_from,
                 salary_to=cur_vacancy.salary_to,
                 description=cur_vacancy.description,
                 requirements=cur_vacancy.requirements,
                 hard_skills=cur_vacancy.hard_skills,
                 count_questions=cur_vacancy.total_questions,
                 ###
                 resume=interview.resume.about
             )}
        ]

        # Получение истории сообщений
        qa_list: QuerySet = interview.qas.all()

        for qa in qa_list:
            messages.append(
                {"role": "assistant",
                 "content": qa.question,}
            )

            messages.append(
                {"role": "user",
                 "content": qa.user_answer}
            )

        return {"messages": messages}

